app/controllers/movies_controller.rb

 def index
    @movies= Movie.all
---
SELECT "movies".* FROM "movies"

 def show
  id = params[:id]
 @movie = Movie.find(id)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "index"]]

def create
    //#debugger

    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

def edit
  @movie = Movie.find (params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

def update
  @movie = Movie.find (params[:id])
  @movie.update_attributes!(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "description" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["description", ""], ["release_date", Tue, 25 Apr 1972 00:00:00 UTC +00:00], ["updated_at", Wed, 05 Mar 2014 01:56:08 UTC +00:00]]